<a href="https://colab.research.google.com/github/usugunawan15/DTI-Telkom/blob/master/Tugas_Klasifikasi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Classification**
Usu Gunawan
DS0223

Dataset bank.csv diakses dari https://www.kaggle.com/janiobachmann/bank-marketing-dataset

**Input Variabel**
1.  Age       : (numeric)
2.  Job       : (categorical: 'admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed','unknown')
3.  Marital   : (categorical: 'divorced','married','single','unknown')
4.  Education : (categorical: primary, secondary, tertiary and unknown)
5.  Default   : (categorical: 'no','yes','unknown')
6.  Housing   : (categorical: 'no','yes','unknown')
7.  Loan      : (categorical: 'no','yes','unknown')
8.  Balance   : Balance of the individual.
9.  Contact   : (categorical: 'cellular','telephone')
10. Month     : (categorical: 'jan', 'feb', 'mar', ..., 'nov', 'dec')
11. Day       : (categorical: 'mon','tue','wed','thu','fri')
12. Duration  : Last contact duration, in seconds (numeric). 
13. Campaign  : (numeric, includes last contact)
14. Pdays     : (numeric; 999 means client was not previously contacted)
15. Previous  : (numeric)
16. Poutcome  : (categorical: 'failure','nonexistent','success')
17. y(deposit): (binary: 'yes','no')

**Import Libraries**

In [3]:
# Import Library
import pandas as pd

**Import Raw Dataset**

In [12]:
# Import Data to Google Colab
df_churn = pd.read_csv('https://raw.githubusercontent.com/usugunawan15/DTI-Telkom/master/data/bank.csv', sep = ',')
df_churn
df_churn.head()

   age         job  marital  education  ... pdays  previous poutcome deposit
0   59      admin.  married  secondary  ...    -1         0  unknown     yes
1   56      admin.  married  secondary  ...    -1         0  unknown     yes
2   41  technician  married  secondary  ...    -1         0  unknown     yes
3   55    services  married  secondary  ...    -1         0  unknown     yes
4   54      admin.  married   tertiary  ...    -1         0  unknown     yes

[5 rows x 17 columns]

In [13]:
# Prints the Dataset Information
df_churn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        11162 non-null  int64
 1   job        11162 non-null  object
 2   marital    11162 non-null  object
 3   education  11162 non-null  object
 4   default    11162 non-null  object
 5   balance    11162 non-null  int64
 6   housing    11162 non-null  object
 7   loan       11162 non-null  object
 8   contact    11162 non-null  object
 9   day        11162 non-null  int64
 10  month      11162 non-null  object
 11  duration   11162 non-null  int64
 12  campaign   11162 non-null  int64
 13  pdays      11162 non-null  int64
 14  previous   11162 non-null  int64
 15  poutcome   11162 non-null  object
 16  deposit    11162 non-null  object
dtypes: int64(7), object(10)
memory usage: 1.4+ MB

In [14]:
# Prints Descriptive Statistics
df_churn.describe().transpose()

            count         mean          std  ...    50%      75%      max
age       11162.0    41.231948    11.913369  ...   39.0    49.00     95.0
balance   11162.0  1528.538524  3225.413326  ...  550.0  1708.00  81204.0
day       11162.0    15.658036     8.420740  ...   15.0    22.00     31.0
duration  11162.0   371.993818   347.128386  ...  255.0   496.00   3881.0
campaign  11162.0     2.508421     2.722077  ...    2.0     3.00     63.0
pdays     11162.0    51.330407   108.758282  ...   -1.0    20.75    854.0
previous  11162.0     0.832557     2.292007  ...    0.0     1.00     58.0

[7 rows x 8 columns]

Data Preprocessing

Handling Missing Values

In [15]:
# Check for Missing Values
df_churn.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
deposit      0
dtype: int64